:- op(1200,xfx,--). term_expansion(A--B,B:-A).

mem(A,Γ;A).
mem(A,Γ;B) :- mem(A, Γ).

integer(I), !
--%----------------------------------------- (E-Int)
eval(Γ,I,I).

eval(Γ,E1,I1),   eval(Γ,E2,I2),   I is I1+I2
--%----------------------------------------- (E-Add)
eval(Γ,E1+E2,I).

eval(Γ,E1,I1),   eval(Γ,E2,I2),   I is I1*I2
--%----------------------------------------- (E-Mul)
eval(Γ,E1*E2,I).

atom(X),!,   mem(X=V,Γ)
--%----------------------------------------- (E-Var)
eval(Γ,X,V).

!
--%----------------------------------------- (E-Abs)
eval(Γ,X->E,closure(Γ;X->E)).

eval(Γ,E1,closure(Γ1;X->E)),   eval(Γ,E2,V2),
eval(Γ1;X=V2,E,V)
--%----------------------------------------- (E-App)
eval(Γ,(E1,E2),V).

:- eval([],(((a->b->a+b),1),2)*3,R),writeln(R),R=9,!,halt.
